In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("Loan_default.csv")

In [3]:
df.head()

,LoanID,Age,Income,LoanAmount,CreditScore,MonthsEmployed,NumCreditLines,InterestRate,LoanTerm,DTIRatio,Education,EmploymentType,MaritalStatus,HasMortgage,HasDependents,LoanPurpose,HasCoSigner,Default
0,I38PQUQS96,56,85994,50587,520,80,4,15.23,36,0.44,Bachelor's,Full-time,Divorced,Yes,Yes,Other,Yes,0
1,HPSK72WA7R,69,50432,124440,458,15,1,4.81,60,0.68,Master's,Full-time,Married,No,No,Other,Yes,0
2,C1OZ6DPJ8Y,46,84208,129188,451,26,3,21.17,24,0.31,Master's,Unemployed,Divorced,Yes,Yes,Auto,No,1
3,V2KKSFM3UN,32,31713,44799,743,0,3,7.07,24,0.23,High School,Full-time,Married,No,No,Business,No,0
4,EY08JDHTZP,60,20437,9139,633,8,4,6.51,48,0.73,Bachelor's,Unemployed,Divorced,No,Yes,Auto,No,0

In [4]:
df.tail()

,LoanID,Age,Income,LoanAmount,CreditScore,MonthsEmployed,NumCreditLines,InterestRate,LoanTerm,DTIRatio,Education,EmploymentType,MaritalStatus,HasMortgage,HasDependents,LoanPurpose,HasCoSigner,Default
255342,8C6S86ESGC,19,37979,210682,541,109,4,14.11,12,0.85,Bachelor's,Full-time,Married,No,No,Other,No,0
255343,98R4KDHNND,32,51953,189899,511,14,2,11.55,24,0.21,High School,Part-time,Divorced,No,No,Home,No,1
255344,XQK1UUUNGP,56,84820,208294,597,70,3,5.29,60,0.50,High School,Self-employed,Married,Yes,Yes,Auto,Yes,0
255345,JAO28CPL4H,42,85109,60575,809,40,1,20.90,48,0.44,High School,Part-time,Single,Yes,Yes,Other,No,0
255346,ZTH91CGL0B,62,22418,18481,636,113,2,6.73,12,0.48,Bachelor's,Unemployed,Divorced,Yes,No,Education,Yes,0

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 255347 entries, 0 to 255346
Data columns (total 18 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   LoanID          255347 non-null  object
 1   Age             255347 non-null  int64
 2   Income          255347 non-null  int64
 3   LoanAmount      255347 non-null  int64
 4   CreditScore     255347 non-null  int64
 5   MonthsEmployed  255347 non-null  int64
 6   NumCreditLines  255347 non-null  int64
 7   InterestRate    255347 non-null  float64
 8   LoanTerm        255347 non-null  int64
 9   DTIRatio        255347 non-null  float64
 10  Education       255347 non-null  object
 11  EmploymentType  255347 non-null  object
 12  MaritalStatus   255347 non-null  object
 13  HasMortgage     255347 non-null  object
 14  HasDependents   255347 non-null  object
 15  LoanPurpose     255347 non-null  object
 16  HasCoSigner     255347 non-null  object
 17  Default         255347 non-null  int64
dtypes: float64(2), int64(8), object(8)
memory usage: 35.1+ MB

In [6]:
df.describe()

,Age,Income,LoanAmount,CreditScore,MonthsEmployed,NumCreditLines,InterestRate,LoanTerm,DTIRatio,Default
count,255347.000000,255347.000000,255347.000000,255347.000000,255347.000000,255347.000000,255347.000000,255347.000000,255347.000000,255347.000000
mean,43.498306,82499.304597,127578.865512,574.264346,59.541976,2.501036,13.492773,36.025894,0.500212,0.116128
std,14.990258,38963.013729,70840.706142,158.903867,34.643376,1.117018,6.636443,16.969330,0.230917,0.320379
min,18.000000,15000.000000,5000.000000,300.000000,0.000000,1.000000,2.000000,12.000000,0.100000,0.000000
25%,31.000000,48825.500000,66156.000000,437.000000,30.000000,2.000000,7.770000,24.000000,0.300000,0.000000
50%,43.000000,82466.000000,127556.000000,574.000000,60.000000,2.000000,13.460000,36.000000,0.500000,0.000000
75%,56.000000,116219.000000,188985.000000,712.000000,90.000000,3.000000,19.250000,48.000000,0.700000,0.000000
max,69.000000,149999.000000,249999.000000,849.000000,119.000000,4.000000,25.000000,60.000000,0.900000,1.000000

In [8]:
df.drop("LoanID", axis=1, inplace=True)

In [10]:
df.head()

,Age,Income,LoanAmount,CreditScore,MonthsEmployed,NumCreditLines,InterestRate,LoanTerm,DTIRatio,Education,EmploymentType,MaritalStatus,HasMortgage,HasDependents,LoanPurpose,HasCoSigner,Default
0,56,85994,50587,520,80,4,15.23,36,0.44,Bachelor's,Full-time,Divorced,Yes,Yes,Other,Yes,0
1,69,50432,124440,458,15,1,4.81,60,0.68,Master's,Full-time,Married,No,No,Other,Yes,0
2,46,84208,129188,451,26,3,21.17,24,0.31,Master's,Unemployed,Divorced,Yes,Yes,Auto,No,1
3,32,31713,44799,743,0,3,7.07,24,0.23,High School,Full-time,Married,No,No,Business,No,0
4,60,20437,9139,633,8,4,6.51,48,0.73,Bachelor's,Unemployed,Divorced,No,Yes,Auto,No,0

In [11]:
df.dtypes

Age                 int64
Income              int64
LoanAmount          int64
CreditScore         int64
MonthsEmployed      int64
NumCreditLines      int64
InterestRate      float64
LoanTerm            int64
DTIRatio          float64
Education          object
EmploymentType     object
MaritalStatus      object
HasMortgage        object
HasDependents      object
LoanPurpose        object
HasCoSigner        object
Default             int64
dtype: object

In [12]:
df.shape

(255347, 17)

In [13]:
df.isna().sum()

Age               0
Income            0
LoanAmount        0
CreditScore       0
MonthsEmployed    0
NumCreditLines    0
InterestRate      0
LoanTerm          0
DTIRatio          0
Education         0
EmploymentType    0
MaritalStatus     0
HasMortgage       0
HasDependents     0
LoanPurpose       0
HasCoSigner       0
Default           0
dtype: int64

In [15]:
df["Default"].value_counts(normalize=True)

Default
0    0.883872
1    0.116128
Name: proportion, dtype: float64

In [16]:
df.groupby("Default")["CreditScore"].describe()

            count        mean         std    min    25%    50%    75%    max
Default
0        225694.0  576.232270  158.849404  300.0  439.0  577.0  714.0  849.0
1         29653.0  559.286143  158.521855  300.0  421.0  553.0  693.0  849.0

In [18]:
df.groupby("Default")["Income"].describe()

,count,mean,std,min,25%,50%,75%,max
Default,,,,,,,,
0,225694.0,83899.165995,38498.801232,15000.0,50994.0,84237.5,117186.75,149999.0
1,29653.0,71844.722659,40785.099507,15004.0,34022.0,66566.0,106895.00,149995.0

In [19]:
df.groupby("Default")["DTIRatio"].describe()

            count      mean       std  min   25%   50%   75%  max
Default
0        225694.0  0.498602  0.231099  0.1  0.30  0.50  0.70  0.9
1         29653.0  0.512467  0.229160  0.1  0.32  0.52  0.71  0.9

In [20]:
df.groupby("Default")["LoanAmount"].describe()

,count,mean,std,min,25%,50%,75%,max
Default,,,,,,,,
0,225694.0,125353.656017,70708.101479,5001.0,63889.25,124236.0,186177.75,249999.0
1,29653.0,144515.311469,69547.822943,5000.0,88085.00,152672.0,205468.00,249993.0

In [21]:
df.groupby("Default")["NumCreditLines"].describe()

            count      mean       std  min  25%  50%  75%  max
Default
0        225694.0  2.489566  1.116350  1.0  1.0  2.0  3.0  4.0
1         29653.0  2.588338  1.118258  1.0  2.0  3.0  4.0  4.0

In [22]:
df.groupby("Default")["InterestRate"].describe()

            count       mean       std  min    25%    50%    75%   max
Default
0        225694.0  13.176994  6.612265  2.0   7.45  12.99  18.85  25.0
1         29653.0  15.896227  6.320304  2.0  11.06  16.93  21.36  25.0

In [23]:
df.groupby("Default")["MonthsEmployed"].describe()

            count       mean        std  min   25%   50%   75%    max
Default
0        225694.0  60.764721  34.556394  0.0  31.0  61.0  91.0  119.0
1         29653.0  50.235457  33.882499  0.0  21.0  46.0  78.0  119.0

In [24]:
df.groupby("Default")["LoanTerm"].describe()

            count       mean        std   min   25%   50%   75%   max
Default
0        225694.0  36.022544  16.966374  12.0  24.0  36.0  48.0  60.0
1         29653.0  36.051394  16.992077  12.0  24.0  36.0  48.0  60.0

In [25]:
df.groupby("Default")["Age"].describe()

            count       mean        std   min   25%   50%   75%   max
Default
0        225694.0  44.409962  14.889574  18.0  32.0  45.0  57.0  69.0
1         29653.0  36.559539  13.897468  18.0  25.0  34.0  47.0  69.0

In [27]:
pd.crosstab(df["Education"], df["Default"], normalize='index')

Default             0         1
Education
Bachelor's   0.878989  0.121011
High School  0.871211  0.128789
Master's     0.891283  0.108717
PhD          0.894140  0.105860

In [28]:
pd.crosstab(df["EmploymentType"], df["Default"], normalize='index')

Default                0         1
EmploymentType
Full-time       0.905366  0.094634
Part-time       0.880348  0.119652
Self-employed   0.885380  0.114620
Unemployed      0.864471  0.135529

In [29]:
pd.crosstab(df["MaritalStatus"], df["Default"], normalize='index')

Default               0         1
MaritalStatus
Divorced       0.874672  0.125328
Married        0.896028  0.103972
Single         0.880876  0.119124

In [30]:
pd.crosstab(df["HasMortgage"], df["Default"], normalize='index')

Default             0         1
HasMortgage
No           0.876549  0.123451
Yes          0.891194  0.108806

In [34]:
pd.crosstab(df["HasDependents"], df["Default"], normalize='index')

Default               0         1
HasDependents
No             0.872756  0.127244
Yes            0.894976  0.105024

In [33]:
pd.crosstab(df["LoanPurpose"], df["Default"], normalize='index')

Default             0         1
LoanPurpose
Auto         0.881186  0.118814
Business     0.876740  0.123260
Education    0.881619  0.118381
Home         0.897652  0.102348
Other        0.882115  0.117885

In [35]:
pd.crosstab(df["HasCoSigner"], df["Default"], normalize='index')

Default             0         1
HasCoSigner
No           0.871339  0.128661
Yes          0.896399  0.103601